    const loanCard = document.getElementById("loanCard");
    const bg = document.getElementById("bg");
    const indicator = document.getElementById("indicator");
    const projectTitle = document.querySelector("#loanCard h1");

    const titles = [
      "مشروع الماجدية 103",
      "مشروع الماجدية 201",
      "مشروع أراضي الماجدية"
    ];

    const indicatorPaths = [
    ` <path d="M10 769L10 -3.4141e-07" stroke="url(#paint0_radial_2092_6016)" stroke-width="0.967742"/>
    <path d="M20.3328 662.547C20.3328 657.069 15.8918 652.628 10.4135 652.628C4.93519 652.628 0.494141 657.069 0.494141 662.547C0.494141 668.026 4.93519 672.467 10.4135 672.467C15.8918 672.467 20.3328 668.026 20.3328 662.547Z" fill="#DCCFBE" stroke="#F4E6D3" stroke-width="0.483871"/>
    <path d="M17.0266 662.547C17.0266 658.895 14.0659 655.934 10.4137 655.934C6.76148 655.934 3.80078 658.895 3.80078 662.547C3.80078 666.199 6.76148 669.16 10.4137 669.16C14.0659 669.16 17.0266 666.199 17.0266 662.547Z" fill="#F4E6D3" stroke="#F4E6D3" stroke-width="0.967742"/>
    <path d="M20.4188 385.081C20.4188 379.603 15.9777 375.162 10.4994 375.162C5.02112 375.162 0.580078 379.603 0.580078 385.081C0.580078 390.559 5.02112 395 10.4994 395C15.9777 395 20.4188 390.559 20.4188 385.081Z" fill="#DCCFBE" stroke="#F4E6D3" stroke-width="0.483871"/>
    <path d="M17.1125 385.08C17.1125 381.428 14.1518 378.467 10.4996 378.467C6.84741 378.467 3.88672 381.428 3.88672 385.08C3.88672 388.732 6.84741 391.693 10.4996 391.693C14.1518 391.693 17.1125 388.732 17.1125 385.08Z" fill="#F4E6D3" stroke="#F4E6D3" stroke-width="0.967742"/>
    <path d="M20.5067 100.419C20.5067 94.9402 16.0656 90.4992 10.5873 90.4992C5.10901 90.4992 0.667969 94.9402 0.667969 100.419C0.667969 105.897 5.10901 110.338 10.5873 110.338C16.0656 110.338 20.5067 105.897 20.5067 100.419Z" fill="#F4E6D3" stroke="#B2795C" stroke-width="0.483871"/>
    <path d="M17.2004 100.418C17.2004 96.7662 14.2397 93.8055 10.5875 93.8055C6.93531 93.8055 3.97461 96.7662 3.97461 100.418C3.97461 104.071 6.93531 107.031 10.5875 107.031C14.2397 107.031 17.2004 104.071 17.2004 100.418Z" fill="#B2795C" stroke="#B2795C" stroke-width="0.967742"/>
    <defs>
    <radialGradient id="paint0_radial_2092_6016" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(4.09309 384.5) rotate(89.9281) scale(384.5 21094.9)">
    <stop stop-color="white"/>
    <stop offset="1" stop-color="white"/>
    </radialGradient>
    </defs>
    `,
    `
    <path d="M10 769L10 -3.4141e-07" stroke="url(#paint0_radial_2092_6052)" stroke-width="0.967742"/>
    <path d="M20.3328 662.547C20.3328 657.069 15.8918 652.628 10.4135 652.628C4.93519 652.628 0.494141 657.069 0.494141 662.547C0.494141 668.026 4.93519 672.467 10.4135 672.467C15.8918 672.467 20.3328 668.026 20.3328 662.547Z" fill="#DCCFBE" stroke="#F4E6D3" stroke-width="0.483871"/>
    <path d="M17.0266 662.547C17.0266 658.895 14.0659 655.934 10.4137 655.934C6.76148 655.934 3.80078 658.895 3.80078 662.547C3.80078 666.199 6.76148 669.16 10.4137 669.16C14.0659 669.16 17.0266 666.199 17.0266 662.547Z" fill="#F4E6D3" stroke="#F4E6D3" stroke-width="0.967742"/>
    <path d="M20.4188 385.081C20.4188 379.603 15.9777 375.162 10.4994 375.162C5.02112 375.162 0.580078 379.603 0.580078 385.081C0.580078 390.559 5.02112 395 10.4994 395C15.9777 395 20.4188 390.559 20.4188 385.081Z" fill="#DCCFBE" stroke="#B2795C" stroke-width="0.483871"/>
    <path d="M17.1125 385.08C17.1125 381.428 14.1518 378.467 10.4996 378.467C6.84741 378.467 3.88672 381.428 3.88672 385.08C3.88672 388.732 6.84741 391.693 10.4996 391.693C14.1518 391.693 17.1125 388.732 17.1125 385.08Z" fill="#B2795C" stroke="#B2795C" stroke-width="0.967742"/>
    <path d="M20.5067 100.419C20.5067 94.9402 16.0656 90.4992 10.5873 90.4992C5.10901 90.4992 0.667969 94.9402 0.667969 100.419C0.667969 105.897 5.10901 110.338 10.5873 110.338C16.0656 110.338 20.5067 105.897 20.5067 100.419Z" fill="#F4E6D3" stroke="#F4E6D3" stroke-width="0.483871"/>
    <path d="M17.2004 100.418C17.2004 96.7662 14.2397 93.8055 10.5875 93.8055C6.93531 93.8055 3.97461 96.7662 3.97461 100.418C3.97461 104.071 6.93531 107.031 10.5875 107.031C14.2397 107.031 17.2004 104.071 17.2004 100.418Z" fill="#F4E6D3" stroke="#F4E6D3" stroke-width="0.967742"/>
    <defs>
    <radialGradient id="paint0_radial_2092_6052" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(4.09309 384.5) rotate(89.9281) scale(384.5 21094.9)">
    <stop stop-color="white"/>
    <stop offset="1" stop-color="white"/>
    </radialGradient>
    </defs>
    `,
    `
    <svg width="21" height="769" viewBox="0 0 21 769" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path d="M10 769L10 -3.4141e-07" stroke="url(#paint0_radial_2092_6088)" stroke-width="0.967742"/>
    <path d="M20.3328 662.547C20.3328 657.069 15.8918 652.628 10.4135 652.628C4.93519 652.628 0.494141 657.069 0.494141 662.547C0.494141 668.026 4.93519 672.467 10.4135 672.467C15.8918 672.467 20.3328 668.026 20.3328 662.547Z" fill="#DCCFBE" stroke="#B2795C" stroke-width="0.483871"/>
    <path d="M17.0266 662.547C17.0266 658.895 14.0659 655.934 10.4137 655.934C6.76148 655.934 3.80078 658.895 3.80078 662.547C3.80078 666.199 6.76148 669.16 10.4137 669.16C14.0659 669.16 17.0266 666.199 17.0266 662.547Z" fill="#B2795C" stroke="#B2795C" stroke-width="0.967742"/>
    <path d="M20.4188 385.081C20.4188 379.603 15.9777 375.162 10.4994 375.162C5.02112 375.162 0.580078 379.603 0.580078 385.081C0.580078 390.559 5.02112 395 10.4994 395C15.9777 395 20.4188 390.559 20.4188 385.081Z" fill="#DCCFBE" stroke="#F4E6D3" stroke-width="0.483871"/>
    <path d="M17.1125 385.08C17.1125 381.428 14.1518 378.467 10.4996 378.467C6.84741 378.467 3.88672 381.428 3.88672 385.08C3.88672 388.732 6.84741 391.693 10.4996 391.693C14.1518 391.693 17.1125 388.732 17.1125 385.08Z" fill="#F4E6D3" stroke="#F4E6D3" stroke-width="0.967742"/>
    <path d="M20.5067 100.419C20.5067 94.9402 16.0656 90.4992 10.5873 90.4992C5.10901 90.4992 0.667969 94.9402 0.667969 100.419C0.667969 105.897 5.10901 110.338 10.5873 110.338C16.0656 110.338 20.5067 105.897 20.5067 100.419Z" fill="#DCCFBE" stroke="#F4E6D3" stroke-width="0.483871"/>
    <path d="M17.2004 100.418C17.2004 96.7662 14.2397 93.8055 10.5875 93.8055C6.93531 93.8055 3.97461 96.7662 3.97461 100.418C3.97461 104.071 6.93531 107.031 10.5875 107.031C14.2397 107.031 17.2004 104.071 17.2004 100.418Z" fill="#F4E6D3" stroke="#F4E6D3" stroke-width="0.967742"/>
    <defs>
    <radialGradient id="paint0_radial_2092_6088" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(4.09309 384.5) rotate(89.9281) scale(384.5 21094.9)">
    <stop stop-color="white"/>
    <stop offset="1" stop-color="white"/>
    </radialGradient>
    </defs>
    </svg>

    `
    ];

    const positions = ["0%", "128%", "222%"];
    const backgrounds = [
      "assets/imges/hero-background-1.jpg",
      "assets/imges/hero-background-2.jpg",
      "assets/imges/hero-background-3.jpg"
    ];

    let index = 0;
    let direction = 1;

    setInterval(() => {
      loanCard.style.transform = `translateY(${positions[index]})`;
      bg.style.backgroundImage = `url('${backgrounds[index]}')`;
      projectTitle.textContent = titles[index];
      indicator.innerHTML = indicatorPaths[index];

      index += direction;
      if (index >= positions.length) {
        index = positions.length - 3;
        direction = -1;
      } else if (index < 0) {
        index = 1;
        direction = 1;
      }
    }, 3000);
